CaishunChen/STM32F4x7_ETH_LwIP_V1.1.0/Project/FreeRTOS/httpserver_netconn/src/tcp_server.c
/*
 * Copyright (c) 2001-2003 Swedish Institute of Computer Science.
 * All rights reserved. 
 * 
 * Redistribution and use in source and binary forms, with or without modification, 
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 * 3. The name of the author may not be used to endorse or promote products
 *    derived from this software without specific prior written permission. 
 *
 * THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR IMPLIED 
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF 
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT 
 * SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, 
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT 
 * OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS 
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN 
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING 
 * IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
 * OF SUCH DAMAGE.
 *
 * This file is part of the lwIP TCP/IP stack.
 * 
 * Author: Adam Dunkels <adam@sics.se>
 *
 */
#include "stdlib.h"
#include "string.h"
#include "stm32f4xx.h"
#include "tcp_server.h"
#include "crc_16.h"
#include "flash.h"
#include "rtc.h"
#include "FreeRTOSConfig.h"
#include "cjson.h"

#include "lwip/opt.h"

#if LWIP_NETCONN

#include "lwip/sys.h"
#include "lwip/api.h"

#define TCPCLIENT_THREAD_PRIO   ( ( configMAX_PRIORITIES - 5 ) ) /*需要注意任务优先级的分配，与各任务之间的调用*/


/*sign in union*/
__attribute__ ((aligned (1)))
//union _SignIn_Union SignIn_Union;

/*TCP client send data mark  */    
uint8_t tcp_client_flag;

/*交易流水号（累加）*/
uint32_t BatchNum = 0;

/*TAG table Value detail*/
uint8_t  Tid[TidLen] = {0x10,0x00,0x00,0x38};
uint8_t  NomiNum[NomiNumLen]={0x10,0x00,0x01};
uint8_t  Bno[BnoLen]={0x00,0x00,0x00};
uint8_t  Brw[BrwLen]={0x00,0x00,0x00,0x00,0x00,0x00,0x00};
uint8_t  DealData[DealDataLen]={0x00,0x00,0x00,0x00};
uint8_t  DealTime[DealTimeLen]={0x00,0x00,0x00};
uint8_t  DevArae[DevAraeLen]={0x17,0x03,0x02};
uint8_t  DevSite[DevSiteLen]={0x17,0x03,0x02,0x07};
uint8_t  AppVer[AppVerLen]={"010312"};  //V1.3.12,则为字符串“010312”
uint8_t  ParaFileVer[ParaFileVerLen]={"010313"};  //V1.3.12,则为字符串“010312”
uint8_t  BusiDatFileVer[BusiDatFileVerLen]={"010314"};  //V1.3.12,则为字符串“010312”
uint8_t  CkSta[CkStaLen]={0x00,0x00};	 //自检状态
uint8_t  UpDatFlag[UpDatFlagLen]={0x00};  //更新标识
uint8_t  CoinNum[CoinNumLen]={0x00,0x10};	//硬币数
uint8_t  DevStatu[DevStatuLen]={0xE8,0x00};  //设备状态
uint8_t  Mac[MacLen]={0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00}; //加密密钥
//uint8_t  MealCompar[36*4]={0x00};
uint8_t  Tradvol[TradvolLen]={0x00,0x00,0x00,0x00,0x15,0x00};	//交易金额
uint8_t  MealId[MealIdLen]={0x10,0x00,0x01,0x38}; //餐品ID
uint8_t  MealQty[MealQtyLen]={0x01}; //餐品数量
uint8_t  MealName[MealNameLen]={0xB7,0xC6,0xC4,0xAA,0xCB,0xB9,0xC5,0xA3,0xC8,0xE2};	//餐品名
uint8_t  MealPrice[MealPriceLen]={0x00,0x00,0x00,0x00,0x15,0x00};		//餐品单价
uint8_t  PayType[PayTypeLen]={0x31};	//支付方式
uint8_t  Change[ChangeLen]={0x00,0x00,0x00,0x00,0x15,0x00};		//找零
uint8_t  RmnMealQty[RmnMealQtyLen]={0x00,0x1};	//剩余数量
uint8_t  TkMealFlag[TkMealFlagLen]={0x01};	//取餐标记 0x01:成功，0x02:失败
uint8_t  PosDevNum[PosDevNumLen]={"1111111111"};	//刷卡器设备号
uint8_t  PosTenantNum[PosTenantNumLen]={"222222"};	//刷卡器商户号
uint8_t  PosBatchNum[PosBatchNumLen]={"3333333333"};	//刷卡器流水号
uint8_t  PosUserNum[PosUserNumLen]={"444444444444444444444"};	//用户卡密码

static uint8_t decode_signin_data(uint8_t *p);
static uint8_t decode_mealcomp_data(uint8_t *p);
static uint8_t decode_statupload_data(uint8_t *p);
static uint8_t decode_echo_data(uint8_t *p);
static uint8_t decode_getmeal_data(uint8_t *p);

/*******************************************************************************
 * 函数名称:Time_Conver  转换时间数据                                                            
 * 描    述:void                                                                   
 *                                                                               
 * 输    入:无                                                                     
 * 输    出:无                                                                     
 * 返    回:无                                                                  
 * 修改日期:2015年5月22日                                                                    
 *******************************************************************************/
void Time_Conver(DATA_TIME_STRUCT *pDataTime)
{
	DealData[0] = 0x20;
	DealData[1] = pDataTime->Year;
	DealData[2] = pDataTime->Month;
	DealData[3] = pDataTime->Date;
	DealTime[0] = pDataTime->Hours;
	DealTime[1] = pDataTime->Minutes;
	DealTime[2] = pDataTime->Senconds;
}

/*******************************************************************************
 * 函数名称:BatchNum_Conver  转换流水号                                                            
 * 描    述:void                                                                   
 *                                                                               
 * 输    入:无                                                                     
 * 输    出:无                                                                     
 * 返    回:无                                                                  
 * 修改日期:2015年5月22日                                                                    
 *******************************************************************************/
void BatchNum_Conver(DATA_TIME_STRUCT *pDataTime,uint8_t * batch_num)
{
	batch_num[0] = 0x20;
	batch_num[1] = pDataTime->Year;
	batch_num[2] = pDataTime->Month;
	batch_num[3] = pDataTime->Date;
	batch_num[4] = pDataTime->Hours;
	batch_num[5] = pDataTime->Minutes;
	batch_num[6] = pDataTime->Senconds;

