CaishunChen/STM32F4x7_ETH_LwIP_V1.1.0/Project/FreeRTOS/httpserver_netconn/src/tcp_server.c
#if 0
	batch_num[0] = 0;
	batch_num[1] = 0;
	batch_num[2] = 0;
	batch_num[3] =  (uint8_t) ((BatchNum >> 24) & 0xFF);
	batch_num[4] =  (uint8_t) ((BatchNum >> 16) & 0xFF);
	batch_num[5] =  (uint8_t) ((BatchNum >> 8) & 0xFF);  
	batch_num[6] =  (uint8_t) (BatchNum & 0xFF);	
	++BatchNum; //流水号增加
#endif
}
/**
  * @brief  获取签到结构提的数据
  * @param  NewState: new state of the Prefetch Buffer.
  *          This parameter  can be: ENABLE or DISABLE.
  * @retval None
  */
uint16_t get_signin_data(uint8_t *p)
{
	//union _SignIn_Union SignIn_Union;
	SignIn_Union   *pSignIn_Union;
	pSignIn_Union = (SignIn_Union *)malloc(sizeof(SignIn_Union));
	/*--GetSignInPacketBuff--TAG value and length*/
	pSignIn_Union->SignIn.Tid = TidChl;
	pSignIn_Union->SignIn.Tid_Len[0] = (TidLen&0xFF00)>>4;
	pSignIn_Union->SignIn.Tid_Len[1] =  TidLen&0x00FF;
	pSignIn_Union->SignIn.NomiNum = NomiNumChl;
	pSignIn_Union->SignIn.NomiNum_Len[0] = (NomiNumLen&0xFF00)>>4;
	pSignIn_Union->SignIn.NomiNum_Len[1] = NomiNumLen&0x00FF;
	pSignIn_Union->SignIn.Brw = BrwChl;
	pSignIn_Union->SignIn.Brw_Len[0] = (BrwLen&0xFF00)>>4;;
	pSignIn_Union->SignIn.Brw_Len[1] = BrwLen&0x00FF;
	pSignIn_Union->SignIn.Bno = BnoChl;
	pSignIn_Union->SignIn.Bno_Len[0] = (BnoLen&0xFF00)>>4;
	pSignIn_Union->SignIn.Bno_Len[1] = BnoLen&0x00FF;
	pSignIn_Union->SignIn.DealData = DealDataChl;
	pSignIn_Union->SignIn.DealData_Len[0] = (DealDataLen&0xFF00)>>4;
	pSignIn_Union->SignIn.DealData_Len[1] = DealDataLen&0x00FF;
	pSignIn_Union->SignIn.DealTime = DealTimeChl;
	pSignIn_Union->SignIn.DealTime_Len[0] = (DealTimeLen&0xFF00)>>4;
	pSignIn_Union->SignIn.DealTime_Len[1] = DealTimeLen&0x00FF;
	pSignIn_Union->SignIn.DevArae = DevAraeChl;
	pSignIn_Union->SignIn.DevArae_Len[0] = (DevAraeLen&0xFF00)>>4;
	pSignIn_Union->SignIn.DevArae_Len[1] = DevAraeLen&0x00FF;
	pSignIn_Union->SignIn.DevSite = DevSiteChl;
	pSignIn_Union->SignIn.DevSite_Len[0] = (DevSiteLen&0xFF00)>>4;
	pSignIn_Union->SignIn.DevSite_Len[1] = DevSiteLen&0x00FF;
	pSignIn_Union->SignIn.AppVer = AppVerChl;
	pSignIn_Union->SignIn.AppVer_Len[0] = (AppVerLen&0xFF00)>>4;
	pSignIn_Union->SignIn.AppVer_Len[1] = AppVerLen&0x00FF;
	pSignIn_Union->SignIn.ParaFileVer = ParaFileVerChl;
	pSignIn_Union->SignIn.ParaFileVer_Len[0] = (ParaFileVerLen&0xFF00)>>4;
	pSignIn_Union->SignIn.ParaFileVer_Len[1] = ParaFileVerLen&0x00FF;
	pSignIn_Union->SignIn.BusiDatFileVer = BusiDatFileVerChl;
	pSignIn_Union->SignIn.BusiDatFileVer_Len[0] = (BusiDatFileVerLen&0xFF00)>>4;
	pSignIn_Union->SignIn.BusiDatFileVer_Len[1] = BusiDatFileVerLen&0x00FF;
	pSignIn_Union->SignIn.CkSta = CkStaChl;
	pSignIn_Union->SignIn.CkSta_Len[0] = (CkStaLen&0xFF00)>>4;; 
	pSignIn_Union->SignIn.CkSta_Len[1] = CkStaLen&0x00FF;  
	/*Get the TAG detail*/
	memcpy(pSignIn_Union->SignIn.Tid_Chl,Tid,sizeof(Tid));
	memcpy(pSignIn_Union->SignIn.NomiNum_Chl,NomiNum,sizeof(NomiNum));
	memcpy(pSignIn_Union->SignIn.Bno_Chl,Bno,sizeof(Bno));
	memcpy(pSignIn_Union->SignIn.Brw_Chl,Brw,sizeof(Brw));
	memcpy(pSignIn_Union->SignIn.DealData_Chl,DealData,sizeof(DealData));
	memcpy(pSignIn_Union->SignIn.DealTime_Chl,DealTime,sizeof(DealTime));
	memcpy(pSignIn_Union->SignIn.DevArae_Chl,DevArae,sizeof(DevArae));
	memcpy(pSignIn_Union->SignIn.DevSite_Chl,DevSite,sizeof(DevSite));
	memcpy(pSignIn_Union->SignIn.AppVer_Chl,AppVer,sizeof(AppVer));
	memcpy(pSignIn_Union->SignIn.ParaFileVer_Chl,ParaFileVer,sizeof(ParaFileVer));
	memcpy(pSignIn_Union->SignIn.BusiDatFileVer_Chl,BusiDatFileVer,sizeof(BusiDatFileVer));
	memcpy(pSignIn_Union->SignIn.CkSta_Chl,CkSta,sizeof(CkSta));
	
	memcpy(p,pSignIn_Union,sizeof(SignIn_Union));
	
	free(pSignIn_Union);
	return  sizeof(SignIn_Union);
}

/**
  * @brief  获取餐品对比结构体数据
  * @param  NewState: new state of the Prefetch Buffer.
  *          This parameter  can be: ENABLE or DISABLE.
  * @retval None
  */
MealDetail_Union  mealdetail_union;
uint16_t get_mealcompar_data(uint8_t *p)
{
	MealCompar_Union *pMealCompar_Union;
	//MealCompar_Union  sMealCompar_Union;
	pMealCompar_Union = (MealCompar_Union *)malloc(sizeof(MealCompar_Union));
	/*--GetSignInPacketBuff--TAG value and length*/
	pMealCompar_Union->MealCompar.Tid = TidChl;
	//sMealCompar_Union. MealCompar.Tid = TidChl;
	pMealCompar_Union->MealCompar.Tid_Len[0] = (TidLen&0xFF00)>>4;
	//sMealCompar_Union. MealCompar.Tid_Len[0] = (TidLen&0xFF00)>>4;
	pMealCompar_Union->MealCompar.Tid_Len[1] =  TidLen&0x00FF;
	//sMealCompar_Union. MealCompar.Tid_Len[1] =  TidLen&0x00FF;
	pMealCompar_Union->MealCompar.Bno = BnoChl;
	//sMealCompar_Union.MealCompar.Bno = BnoChl;
	pMealCompar_Union->MealCompar.Bno_Len[0] = (BnoLen&0xFF00)>>4;
	//sMealCompar_Union. MealCompar.Bno_Len[0] = (BnoLen&0xFF00)>>4;
	pMealCompar_Union->MealCompar.Bno_Len[1] =  BnoLen&0x00FF;
	//sMealCompar_Union. MealCompar.Bno_Len[1] =  BnoLen&0x00FF;
	pMealCompar_Union->MealCompar.Brw = BrwChl;
	//sMealCompar_Union. MealCompar.Brw = BrwChl;
	pMealCompar_Union->MealCompar.Brw_Len[0] = (BrwLen&0xFF00)>>4;
	//sMealCompar_Union. MealCompar.Brw_Len[0] = (BrwLen&0xFF00)>>4;
	pMealCompar_Union->MealCompar.Brw_Len[1] =  BrwLen&0x00FF;
	//sMealCompar_Union. MealCompar.Brw_Len[1] =  BrwLen&0x00FF;
	pMealCompar_Union->MealCompar.DevArae = DevAraeChl;
	//sMealCompar_Union. MealCompar.DevArae = DevAraeChl;
	pMealCompar_Union->MealCompar.DevArae_Len[0] = (DevAraeLen&0xFF00)>>4;
	//sMealCompar_Union. MealCompar.DevArae_Len[0] = (DevAraeLen&0xFF00)>>4;
	pMealCompar_Union->MealCompar.DevArae_Len[1] =  DevAraeLen&0x00FF;
	//sMealCompar_Union. MealCompar.DevArae_Len[1] =  DevAraeLen&0x00FF;
	pMealCompar_Union->MealCompar.DevSite = DevSiteChl;
	//sMealCompar_Union. MealCompar.DevSite = DevSiteChl;
	pMealCompar_Union->MealCompar.DevSite_Len[0] = (DevSiteLen&0xFF00)>>4;
	//sMealCompar_Union. MealCompar.DevSite_Len[0] = (DevSiteLen&0xFF00)>>4;
	pMealCompar_Union->MealCompar.DevSite_Len[1] =  DevSiteLen&0x00FF;
	//sMealCompar_Union. MealCompar.DevSite_Len[1] =  DevSiteLen&0x00FF;
	pMealCompar_Union->MealCompar.MealCompar = MealComparChl;
	//sMealCompar_Union. MealCompar.MealCompar = MealComparChl;
	pMealCompar_Union->MealCompar.MealCompar_Len[0] = (MealComparLen&0xFF00)>>4;
	//sMealCompar_Union. MealCompar.MealCompar_Len[0] = (MealComparLen&0xFF00)>>4;
	pMealCompar_Union->MealCompar.MealCompar_Len[1] =  MealComparLen&0x00FF;
	//sMealCompar_Union. MealCompar.MealCompar_Len[1] =  MealComparLen&0x00FF;
	pMealCompar_Union->MealCompar.Mac = MacChl;
	//sMealCompar_Union. MealCompar.Mac = MacChl;
	pMealCompar_Union->MealCompar.Mac_Len[0] = (MacLen&0xFF00)>>4;
	//sMealCompar_Union. MealCompar.Mac_Len[0] = (MacLen&0xFF00)>>4;
	pMealCompar_Union->MealCompar.Mac_Len[1] =  MacLen&0x00FF;
	//sMealCompar_Union. MealCompar.Mac_Len[1] =  MacLen&0x00FF;
	
	memcpy(pMealCompar_Union->MealCompar.Tid_Chl,Tid,sizeof(Tid));
	//memcpy(sMealCompar_Union. MealCompar.Tid_Chl,Tid,sizeof(Tid));
	memcpy(pMealCompar_Union->MealCompar.Bno_Chl,Bno,sizeof(Bno));
	//memcpy(sMealCompar_Union. MealCompar.Bno_Chl,Bno,sizeof(Bno));
	memcpy(pMealCompar_Union->MealCompar.Brw_Chl,Brw,sizeof(Brw));
	//memcpy(sMealCompar_Union. MealCompar.Brw_Chl,Brw,sizeof(Brw));
	memcpy(pMealCompar_Union->MealCompar.DevArae_Chl,DevArae,sizeof(DevArae));
	//memcpy(sMealCompar_Union. MealCompar.DevArae_Chl,DevArae,sizeof(DevArae));
	memcpy(pMealCompar_Union->MealCompar.DevSite_Chl,DevSite,sizeof(DevSite));
	//memcpy(sMealCompar_Union. MealCompar.DevSite_Chl,DevSite,sizeof(DevSite));
	/*start------获取餐品对比的相关信息，拷贝到相关结构体中--------------------*/
	for (int i = 0; i < MealKindTotoal; ++i)
	{
		memcpy(mealdetail_union.MealDetail[i].MealID,Meal_Union.Meal[i].MealID,sizeof(Meal_Union.Meal[i].MealID));
		memcpy(mealdetail_union.MealDetail[i].MealName,Meal_Union.Meal[i].MealName,sizeof(Meal_Union.Meal[i].MealName));
		memcpy(mealdetail_union.MealDetail[i].MealCnt,Meal_Union.Meal[i].MealCnt,sizeof(Meal_Union.Meal[i].MealCnt));
		memcpy(mealdetail_union.MealDetail[i].MealPrice,Meal_Union.Meal[i].MealPrice,sizeof(Meal_Union.Meal[i].MealPrice));
		memcpy(mealdetail_union.MealDetail[i].MealType,Meal_Union.Meal[i].MealType,sizeof(Meal_Union.Meal[i].MealType));
	}
	memcpy(pMealCompar_Union->MealCompar.MealCompar_Chl,mealdetail_union.MealDetailBuf,sizeof(mealdetail_union.MealDetailBuf));
	//memcpy(sMealCompar_Union.MealCompar.MealCompar_Chl,mealdetail_union.MealDetailBuf,sizeof(mealdetail_union.MealDetailBuf));
	/*------------获取餐品对比的相关信息，拷贝到相关结构体中-----------------end*/
	memcpy(pMealCompar_Union->MealCompar.Mac_Chl,Mac,sizeof(Mac));
	//memcpy(sMealCompar_Union. MealCompar.Mac_Chl,Mac,sizeof(Mac));
	memcpy(p,pMealCompar_Union->MealComparBuf,sizeof(pMealCompar_Union->MealComparBuf));
	//memcpy(p,sMealCompar_Union.MealComparBuf,sizeof(sMealCompar_Union.MealComparBuf));
	free(pMealCompar_Union);
	return  sizeof(pMealCompar_Union->MealComparBuf);  
}
  
/**
  * @brief  获取状态上送结构体数据
  * @param  NewState: new state of the Prefetch Buffer.
  *          This parameter  can be: ENABLE or DISABLE.
  * @retval None
  */
uint16_t get_statupload_data(uint8_t *p)
{
	StatuUpload_Union *pStatuUpload_Union;
	pStatuUpload_Union = (StatuUpload_Union *)malloc(sizeof(pStatuUpload_Union));
	/*--GetStatuUploadPacketBuff--TAG value and length*/
	pStatuUpload_Union->StatuUpload.Tid = TidChl;
	pStatuUpload_Union->StatuUpload.Tid_Len[0] = (TidLen&0xFF00)>>4;
	pStatuUpload_Union->StatuUpload.Tid_Len[1] =  TidLen&0x00FF;
	pStatuUpload_Union->StatuUpload.Brw = BrwChl;
	pStatuUpload_Union->StatuUpload.Brw_Len[0] = (BrwLen&0xFF00)>>4;;
	pStatuUpload_Union->StatuUpload.Brw_Len[1] = BrwLen&0x00FF;
	pStatuUpload_Union->StatuUpload.Bno = BnoChl;
	pStatuUpload_Union->StatuUpload.Bno_Len[0] = (BnoLen&0xFF00)>>4;
	pStatuUpload_Union->StatuUpload.Bno_Len[1] = BnoLen&0x00FF;  
	pStatuUpload_Union->StatuUpload.CoinNum = CoinNumChl;
	pStatuUpload_Union->StatuUpload.CoinNum_Len[0] = (CoinNumLen&0xFF00)>>4;
	pStatuUpload_Union->StatuUpload.CoinNum_Len[1] = CoinNumLen&0x00FF;  
	pStatuUpload_Union->StatuUpload.DevStatu = DevStatuChl;
	pStatuUpload_Union->StatuUpload.DevStatu_Len[0] = (DevStatuLen&0xFF00)>>4;
	pStatuUpload_Union->StatuUpload.DevStatu_Len[1] = DevStatuLen&0x00FF; 
	
	memcpy(pStatuUpload_Union->StatuUpload.Tid_Chl,Tid,sizeof(Tid));
	memcpy(pStatuUpload_Union->StatuUpload.Brw_Chl,Brw,sizeof(Brw));
	memcpy(pStatuUpload_Union->StatuUpload.Bno_Chl,Bno,sizeof(Bno));
	memcpy(pStatuUpload_Union->StatuUpload.CoinNum_Chl,CoinNum,sizeof(CoinNum));
	memcpy(pStatuUpload_Union->StatuUpload.DevStatu_Chl,Tid,sizeof(DevStatu));

