CaishunChen/STM32F4x7_ETH_LwIP_V1.1.0/Project/FreeRTOS/httpserver_netconn/src/tcp_server.c
	memcpy(p,pStatuUpload_Union,sizeof(pStatuUpload_Union->StatuUploafBuf));
	free(pStatuUpload_Union);
	return  sizeof(pStatuUpload_Union->StatuUploafBuf);
}

/**
  * @brief  获取回响测试结构体数据
  * @param  NewState: new state of the Prefetch Buffer.
  *          This parameter  can be: ENABLE or DISABLE.
  * @retval None
  */
uint16_t get_echo_data(uint8_t *p)
{
	Echo_Union *pEcho_Union;
	pEcho_Union = (Echo_Union *)malloc(sizeof(pEcho_Union));
	
	pEcho_Union->Echo.Tid = TidChl;
	pEcho_Union->Echo.Tid_Len[0] = (TidLen&0xFF00)>>4;
	pEcho_Union->Echo.Tid_Len[1] =  TidLen&0x00FF;
	pEcho_Union->Echo.DealData = DealDataChl;
	pEcho_Union->Echo.DealData_Len[0] = (DealDataLen&0xFF00)>>4;
	pEcho_Union->Echo.DealData_Len[1] =  DealDataLen&0x00FF;	
	pEcho_Union->Echo.DealTime = DealTimeChl;
	pEcho_Union->Echo.DealTime_Len[0] = (DealTimeLen&0xFF00)>>4;
	pEcho_Union->Echo.DealTime_Len[1] =  DealTimeLen&0x00FF;
	pEcho_Union->Echo.UpDatFlag = UpDatFlagChl;
	pEcho_Union->Echo.UpDatFlag_Len[0] = (UpDatFlagLen&0xFF00)>>4;
	pEcho_Union->Echo.UpDatFlag_Len[1] =  UpDatFlagLen&0x00FF;	
	
	memcpy(pEcho_Union->Echo.Tid_Chl,Tid,sizeof(Tid));
	memcpy(pEcho_Union->Echo.DealData_Chl,DealData,sizeof(DealData));
	memcpy(pEcho_Union->Echo.DealTime_Chl,DealTime,sizeof(DealTime));
	memcpy(pEcho_Union->Echo.UpDatFlag_Chl,UpDatFlag,sizeof(UpDatFlag));
	
	memcpy(p,pEcho_Union,sizeof(pEcho_Union->EchoBuf));
	free(pEcho_Union);
	return  sizeof(pEcho_Union->EchoBuf);	
}

/**
  * @brief  获取取餐结构体数据
  * @param  NewState: new state of the Prefetch Buffer.
  *          This parameter  can be: ENABLE or DISABLE.
  * @retval None
  */
uint16_t get_tkmeal_data(uint8_t *p)
{
	TakeMeal_Union *pTakeMeal_Union;
	pTakeMeal_Union = (TakeMeal_Union *)malloc(sizeof(pTakeMeal_Union));
	
	pTakeMeal_Union->TakeMeal.Tid = TidChl;
	pTakeMeal_Union->TakeMeal.Tid_Len[0] = (TidLen&0xFF00)>>4;
	pTakeMeal_Union->TakeMeal.Tid_Len[1] =  TidLen&0x00FF;
	pTakeMeal_Union->TakeMeal.Brw = BrwChl;
	pTakeMeal_Union->TakeMeal.Brw_Len[0] = (BrwLen&0xFF00)>>4;
	pTakeMeal_Union->TakeMeal.Brw_Len[1] =  BrwLen&0x00FF;
	pTakeMeal_Union->TakeMeal.Bno = BnoChl;
	pTakeMeal_Union->TakeMeal.Bno_Chl[0] = (BnoLen&0xFF00)>>4;
	pTakeMeal_Union->TakeMeal.Bno_Chl[1] =  BnoLen&0x00FF;
	pTakeMeal_Union->TakeMeal.DevArae = DevAraeChl;
	pTakeMeal_Union->TakeMeal.DevArae_Len[0] = (DevAraeLen&0xFF00)>>4;
	pTakeMeal_Union->TakeMeal.DevArae_Len[1] =  DevAraeLen&0x00FF;
	pTakeMeal_Union->TakeMeal.DevSite = DevSiteChl;
	pTakeMeal_Union->TakeMeal.DevSite_Len[0] = (DevSiteLen&0xFF00)>>4;
	pTakeMeal_Union->TakeMeal.DevSite_Len[1] =  DevSiteLen&0x00FF;
	pTakeMeal_Union->TakeMeal.Tradvol = TradvolChl;
	pTakeMeal_Union->TakeMeal.Tradvol_Len[0] = (TradvolLen&0xFF00)>>4;
	pTakeMeal_Union->TakeMeal.Tradvol_Len[1] =  TradvolLen&0x00FF;
	pTakeMeal_Union->TakeMeal.MealId = MealIdChl;
	pTakeMeal_Union->TakeMeal.MealId_Len[0] = (MealIdLen&0xFF00)>>4;
	pTakeMeal_Union->TakeMeal.MealId_Len[1] =  MealIdLen&0x00FF;
	pTakeMeal_Union->TakeMeal.MealQty = MealQtyChl;
	pTakeMeal_Union->TakeMeal.MealQty_Len[0] = (MealQtyLen&0xFF00)>>4;
	pTakeMeal_Union->TakeMeal.MealQty_Len[1] =  MealQtyLen&0x00FF;
	pTakeMeal_Union->TakeMeal.MealName = MealNameChl;
	pTakeMeal_Union->TakeMeal.MealName_Len[0] = (MealNameLen&0xFF00)>>4;
	pTakeMeal_Union->TakeMeal.MealName_Len[1] =  MealNameLen&0x00FF;
	pTakeMeal_Union->TakeMeal.MealPrice = MealPriceChl;
	pTakeMeal_Union->TakeMeal.MealPrice_Len[0] = (MealPriceLen&0xFF00)>>4;
	pTakeMeal_Union->TakeMeal.MealPrice_Len[1] =  MealPriceLen&0x00FF;
	pTakeMeal_Union->TakeMeal.PayType = PayTypeChl;
	pTakeMeal_Union->TakeMeal.PayType_Len[0] = (PayTypeLen&0xFF00)>>4;
	pTakeMeal_Union->TakeMeal.PayType_Len[1] =  PayTypeLen&0x00FF;
	pTakeMeal_Union->TakeMeal.Change = ChangeChl;
	pTakeMeal_Union->TakeMeal.Change_Len[0] = (ChangeLen&0xFF00)>>4;
	pTakeMeal_Union->TakeMeal.Change_Len[1] =  ChangeLen&0x00FF;
	pTakeMeal_Union->TakeMeal.RmnMealQty = RmnMealQtyChl;
	pTakeMeal_Union->TakeMeal.RmnMealQty_Len[0] = (RmnMealQtyLen&0xFF00)>>4;
	pTakeMeal_Union->TakeMeal.RmnMealQty_Len[1] =  RmnMealQtyLen&0x00FF;
	pTakeMeal_Union->TakeMeal.TkMealFlag = TkMealFlagChl;
	pTakeMeal_Union->TakeMeal.TkMealFlag_Len[0] = (TkMealFlagLen&0xFF00)>>4;
	pTakeMeal_Union->TakeMeal.TkMealFlag_Len[1] = TkMealFlagLen&0x00FF;
	pTakeMeal_Union->TakeMeal.PosDevNum = PosDevNumChl;
	pTakeMeal_Union->TakeMeal.PosDevNum_Len[0] = (PosDevNumLen&0xFF00)>>4;
	pTakeMeal_Union->TakeMeal.PosDevNum_Len[1] =  PosDevNumLen&0x00FF;
	pTakeMeal_Union->TakeMeal.PosTenantNum = PosTenantNumChl;
	pTakeMeal_Union->TakeMeal.PosTenantNum_Len[0] = (PosTenantNumLen&0xFF00)>>4;
	pTakeMeal_Union->TakeMeal.PosTenantNum_Len[1] =  PosTenantNumLen&0x00FF;
	pTakeMeal_Union->TakeMeal.PosBatchNum = PosBatchNumChl;
	pTakeMeal_Union->TakeMeal.PosBatchNum_Len[0] = (PosBatchNumLen&0xFF00)>>4;
	pTakeMeal_Union->TakeMeal.PosBatchNum_Len[1] =  PosBatchNumLen&0x00FF;
	pTakeMeal_Union->TakeMeal.PosUserNum = PosUserNumChl;
	pTakeMeal_Union->TakeMeal.PosUserNum_Len[0] = (PosUserNumLen&0xFF00)>>4;
	pTakeMeal_Union->TakeMeal.PosUserNum_Len[1] =  PosUserNumLen&0x00FF;
	pTakeMeal_Union->TakeMeal.Mac = MacChl;
	pTakeMeal_Union->TakeMeal.Mac_Len[0] = (MacLen&0xFF00)>>4;;
	pTakeMeal_Union->TakeMeal.Mac_Len[1] =  MacLen&0x00FF;
	
	memcpy(pTakeMeal_Union->TakeMeal.Tid_Chl,Tid,sizeof(Tid));
	memcpy(pTakeMeal_Union->TakeMeal.Brw_Chl,Brw,sizeof(Brw));
	memcpy(pTakeMeal_Union->TakeMeal.Bno_Chl,Bno,sizeof(Bno));
	memcpy(pTakeMeal_Union->TakeMeal.DevArae_Chl,DevArae,sizeof(DevArae));
	memcpy(pTakeMeal_Union->TakeMeal.DevSite_Chl,DevSite,sizeof(DevSite));
	memcpy(pTakeMeal_Union->TakeMeal.Tradvol_Chl,Tradvol,sizeof(Tradvol));
	memcpy(pTakeMeal_Union->TakeMeal.MealId_Chl,MealId,sizeof(MealId));
	memcpy(pTakeMeal_Union->TakeMeal.MealQty_Chl,MealQty,sizeof(MealQty));
	memcpy(pTakeMeal_Union->TakeMeal.MealName_Chl,MealName,sizeof(MealName));
	memcpy(pTakeMeal_Union->TakeMeal.MealPrice_Chl,MealPrice,sizeof(MealPrice));
	memcpy(pTakeMeal_Union->TakeMeal.PayType_Chl,PayType,sizeof(PayType));
	memcpy(pTakeMeal_Union->TakeMeal.Change_Chl,Change,sizeof(Change));
	memcpy(pTakeMeal_Union->TakeMeal.RmnMealQty_Chl,RmnMealQty,sizeof(RmnMealQty));
	memcpy(pTakeMeal_Union->TakeMeal.TkMealFlag_Chl,TkMealFlag,sizeof(TkMealFlag));
	memcpy(pTakeMeal_Union->TakeMeal.PosDevNum_Chl,PosDevNum,sizeof(PosDevNum));
	memcpy(pTakeMeal_Union->TakeMeal.PosTenantNum_Chl,PosTenantNum,sizeof(PosTenantNum));
	memcpy(pTakeMeal_Union->TakeMeal.PosBatchNum_Chl,PosBatchNum,sizeof(PosBatchNum));
	memcpy(pTakeMeal_Union->TakeMeal.PosUserNum_Chl,PosUserNum,sizeof(PosUserNum));
	memcpy(pTakeMeal_Union->TakeMeal.Mac_Chl,Mac,sizeof(Mac));
	
	memcpy(p,pTakeMeal_Union,sizeof(pTakeMeal_Union->TakeMealBuf));
	free(pTakeMeal_Union);
	return  sizeof(pTakeMeal_Union->TakeMealBuf);		
}
  
/**
  * @brief  将签到的数据指向sendbuff,这样就可以避免复制了
  * @param  NewState: new state of the Prefetch Buffer.
  *          This parameter  can be: ENABLE or DISABLE.
  * @retval None
  */

