CaishunChen/STM32F4x7_ETH_LwIP_V1.1.0/Project/FreeRTOS/httpserver_netconn/src/tcp_server.c
PACKET_STRUCT pcket_struct;   //帧的封装格式
void package_buff(uint16_t Request,uint8_t *request_buf)
{
	uint16_t crc_value;
	uint16_t contex_lenth=0;
	DATA_TIME_STRUCT DataTime;
	RTC_TimeShow(&DataTime);    //获取时间
	Time_Conver(&DataTime);		//转换时间数据到数组
	BatchNum_Conver(&DataTime,Brw);  //获取流水号
	pcket_struct.Stx = StxChl;  //获取帧头
	pcket_struct.Etx = EtxChl;  //获取帧尾
	pcket_struct.CmdReq[0]= ((Request&0xff00)>>8);  //获取请求
	pcket_struct.CmdReq[1]=  (Request&0x00ff);        
	memcpy(request_buf,&pcket_struct.Stx,sizeof(pcket_struct.Stx)); //复制单个使用地址 ：帧头
	memcpy(request_buf+1,pcket_struct.CmdReq,sizeof(pcket_struct.CmdReq)); //复制签到请求命令 
	//获取时间
	switch(Request)
	{
		case SignInReq:{
			contex_lenth = get_signin_data(request_buf+5); 
			//将签到用到的结构体中的数据写入sign_in_buf中，偏移5个位置，返回签到结构体的字节数 
		}break;
		case MealComparReq:{
			//SPI_Flash_Read(Meal_Union.MealBuf,MENU_RECORD_STAR,sizeof(Meal_Union));
			contex_lenth = get_mealcompar_data(request_buf+5); 
			//将签到用到的结构体中的数据写入sign_in_buf中，偏移5个位置，返回签到结构体的字节数 
		}break;
		case StatuUploadReq:{
			contex_lenth = get_statupload_data(request_buf+5); 
			//将签到用到的结构体中的数据写入sign_in_buf中，偏移5个位置，返回签到结构体的字节数     
		}break;
		case TkMealReq:{
			contex_lenth = get_tkmeal_data(request_buf+5); 
			//将签到用到的结构体中的数据写入sign_in_buf中，偏移5个位置，返回签到结构体的字节数        
		}break;
		case EchoReq:{
			contex_lenth = get_echo_data(request_buf+5); 
			//将签到用到的结构体中的数据写入sign_in_buf中，偏移5个位置，返回签到结构体的字节数 
		}break;
		default:break; 
	}
	pcket_struct.FrameLen[0]= ((contex_lenth&0xff00)>>8);
	pcket_struct.FrameLen[1]= (contex_lenth&0x00ff);
	memcpy(request_buf+3,pcket_struct.FrameLen,sizeof(pcket_struct.FrameLen)); //复制签到请求内容长度
	memcpy(request_buf+5+contex_lenth,&pcket_struct.Etx,sizeof(pcket_struct.Etx)); //复制单个使用地址 ：帧尾
	crc_value =  crc_ccitt(request_buf+1,contex_lenth+4);  //获取Crc的值，从帧头到帧尾
	pcket_struct.Crc[0]= ((crc_value&0xff00)>>8);
	pcket_struct.Crc[1]= (crc_value&0x00ff);
	memcpy(request_buf+6+contex_lenth,pcket_struct.Crc,sizeof(pcket_struct.Crc)); //复制CRC值    
}

/**
  * @brief  解码重服务器返回的数据
  * @param  NewState: new state of the Prefetch Buffer.
  *          This parameter  can be: ENABLE or DISABLE.
  * @retval None
  */
uint8_t decode_host_data(uint8_t *ptr)
{
	uint8_t err;
	static uint16_t res_cmd = 0,res_len = 0,crc_value=0,crc_value_calcu=0;
	if(ptr[0]!= StxChl)   return 1;  //判断帧头
	res_cmd = (ptr[1]<<8) + ptr[2];  //获取响应命令
	res_len = (ptr[3]<<8) + ptr[4];  //获取长度数据
	if(ptr[res_len+5]!= EtxChl)    return 2;  //判断帧尾
	crc_value = (ptr[res_len+6]<<8) + ptr[res_len+7];  //获取CRC16的值
	crc_value_calcu = GetCRC16(&ptr[1],res_len+4);//计算CRC的值
	if(crc_value != crc_value_calcu) return 3;  //判断CRC,校验数据的完整性 ,校验出错，不批匹配，不知道
	switch(res_cmd)
	{
		case SignInRes:
		{
			err = decode_signin_data(&ptr[5]);
		};break;
		case MealComparRes:
		{
			err = decode_mealcomp_data(&ptr[5]);
		};break;
		case StatuUploadRes:
		{
			err = decode_statupload_data(&ptr[5]);
		};break;
		case TkMealRes:
		{
			err = decode_getmeal_data(&ptr[5]);
		};break; 
		case EchoRes:
		{
			err = decode_echo_data(&ptr[5]);
		}
		default:
		{
			return 4;  //返回的命令请求错误
		}
	}
	return err;
}

/**
  * @brief  解码四种有服务器返回的数据
  * @param  NewState: new state of the Prefetch Buffer.
  *          This parameter  can be: ENABLE or DISABLE.
  * @retval None
  */
SIGN_IN_REQ_STRUCT sigin_req;
//extern Meal_Union meal_union;
//static uint8_t MealBuf[sizeof(Meal_Union.MealBuf)];
static uint8_t decode_signin_data(uint8_t *p)
{
	uint32_t byte_count=0;
	if(p[byte_count++]==NomiNameChl)
	{
		sigin_req.NomiName =NomiNameChl;
		sigin_req.NomiName_Len = (p[byte_count++]<<4);
		sigin_req.NomiName_Len += (p[byte_count++]); 
		for(uint8_t i=0;i<sigin_req.NomiName_Len;i++)
		{
			sigin_req.NomiName_Chl[i] = p[byte_count++];
		}
	}
	if(p[byte_count++]==BnoChl)
	{
		sigin_req.Bno =BrwChl;
		sigin_req.Bno_Len = (p[byte_count++]<<4);
		sigin_req.Bno_Len += (p[byte_count++]); 
		for(uint8_t i=0;i<sigin_req.Bno_Len;i++)
		{
			sigin_req.Bno_Chl[i] = p[byte_count++];
		}
		memcpy(Bno,sigin_req.Bno_Chl,BnoLen); //更新内部的批次号
	}
	if(p[byte_count++]==AppVerChl)
	{
		sigin_req.AppVer =AppVerChl;
		sigin_req.AppVer_Len = (p[byte_count++]<<4);
		sigin_req.AppVer_Len += (p[byte_count++]); 
		for(uint8_t i=0;i<sigin_req.AppVer_Len;i++)
		{
			sigin_req.AppVer_Chl[i] = p[byte_count++];
		}
	}
	if(p[byte_count++]==ParaFileVerChl)
	{
		sigin_req.ParaFileVer =ParaFileVerChl;
		sigin_req.ParaFileVer_Len = (p[byte_count++]<<4);
		sigin_req.ParaFileVer_Len += (p[byte_count++]); 
		for(uint8_t i=0;i<sigin_req.ParaFileVer_Len;i++)
		{
			sigin_req.ParaFileVer_Chl[i] = p[byte_count++];
		}
	}
	if(p[byte_count++]==BusiDatFileVerChl)
	{
		sigin_req.BusiDatFileVer =BusiDatFileVerChl;
		sigin_req.BusiDatFileVer_Len = (p[byte_count++]<<4);
		sigin_req.BusiDatFileVer_Len += (p[byte_count++]); 
		for(uint8_t i=0;i<sigin_req.BusiDatFileVer_Len;i++)
		{
			sigin_req.BusiDatFileVer_Chl[i] = p[byte_count++];
		}
	}
	if(p[byte_count++]==UpDatFlagChl)
	{
		sigin_req.UpDatFlag =UpDatFlagChl;
		sigin_req.UpDatFlag_Len = (p[byte_count++]<<4);
		sigin_req.UpDatFlag_Len += (p[byte_count++]); 
		for(uint8_t i=0;i<sigin_req.UpDatFlag_Len;i++)
		{
			sigin_req.UpDatFlag_Chl[i] = p[byte_count++];
		}
	}
	if(p[byte_count++]==MenuNumChl)
	{
		sigin_req.MenuNum =MenuNumChl;
		sigin_req.MenuNum_Len = (p[byte_count++]<<4);
		sigin_req.MenuNum_Len += (p[byte_count++]); 
		for(uint8_t i=0;i<sigin_req.MenuNum_Len;i++)
		{
			sigin_req.MenuNum_Chl[i] = p[byte_count++];
		}
	}
	if(p[byte_count++]==MenuDetailChl)
	{
		sigin_req.MenuDetail =MenuDetailChl;
		sigin_req.MenuDetail_Len = (p[byte_count++]<<4);
		sigin_req.MenuDetail_Len += (p[byte_count++]); 
		for(uint8_t i=0;i<sigin_req.MenuDetail_Len;i++)
		{
			sigin_req.MenuDetail_Chl[i] = p[byte_count];
			Meal_Union.MealBuf[i] = p[byte_count++];
		}
		//将餐品的数据写入flash 
		//SPI_Flash_Write(Meal_Union.MealBuf,MENU_RECORD_STAR,sizeof(Meal_Union));
		//SPI_Flash_Read(MealBuf,MENU_RECORD_STAR,sizeof(Meal_Union));
	}
	if(p[byte_count++]==AckChl)
	{
		sigin_req.Ack =AckChl;
		sigin_req.Ack_Len = (p[byte_count++]<<4);
		sigin_req.Ack_Len += (p[byte_count++]); 
		for(uint8_t i=0;i<sigin_req.Ack_Len;i++)
		{
			sigin_req.Ack_Chl[i] = p[byte_count++];
		}
	}
	if(p[byte_count++]==CipherChl)
	{
		sigin_req.Cipher =CipherChl;
		sigin_req.Cipher_Len = (p[byte_count++]<<4);
		sigin_req.Cipher_Len += (p[byte_count++]); 
		for(uint8_t i=0;i<sigin_req.Cipher_Len;i++)
		{
		 	sigin_req.Cipher_Chl[i] = p[byte_count++];
		}
	}
	return 0;
}

MEAL_COMPAR_REQ_STRUCT mealcompar_req;
MealDetailReq_Union  mealdetail_unoin;
static uint8_t decode_mealcomp_data(uint8_t *p)
{
	uint32_t byte_count=0;	
	if (p[byte_count++]==AckChl)
	{
		mealcompar_req.Ack =AckChl;
		mealcompar_req.Ack_Len = (p[byte_count++]<<4);
		mealcompar_req.Ack_Len += (p[byte_count++]); 
		for(uint8_t i=0;i<mealcompar_req.Ack_Len;i++)
		{
			mealcompar_req.Ack_Chl[i] = p[byte_count++];
		}
	}
	if (p[byte_count++]==MealComparChl)
	{
		mealcompar_req.MealCompar =MealComparChl;
		mealcompar_req.MealCompar_Len = (p[byte_count++]<<4);
		mealcompar_req.MealCompar_Len += (p[byte_count++]); 
		for(uint8_t i=0;i<mealcompar_req.MealCompar_Len;i++)
		{
			mealdetail_unoin.MealDetailReqBuf[i] = p[byte_count];
			mealcompar_req.MealCompar_Chl[i] = p[byte_count++];
		}
	}
	if (p[byte_count++]==MacChl)
	{
		mealcompar_req.Mac =MacChl;
		mealcompar_req.Mac_Len = (p[byte_count++]<<4);
		mealcompar_req.Mac_Len += (p[byte_count++]); 
		for(uint8_t i=0;i<mealcompar_req.Mac_Len;i++)
		{
			mealcompar_req.Mac_Chl[i] = p[byte_count++];
		}
	}
	return 0;
}

STATU_UPLOAD_REQ_STRUCT statuupload_req;
static uint8_t decode_statupload_data(uint8_t *p)
{
	uint32_t byte_count=0;       
	if (p[byte_count++]==AckChl)
	{
		statuupload_req.Ack =AckChl;
		statuupload_req.Ack_Len = (p[byte_count++]<<4);
		statuupload_req.Ack_Len += (p[byte_count++]); 
		for(uint8_t i=0;i<statuupload_req.Ack_Len;i++)
		{
			statuupload_req.Ack_Chl[i] = p[byte_count++];
		}
	}
	return 0;
}
TAKE_MEAL_REQ_STRUCT takemeal_req;
static uint8_t decode_getmeal_data(uint8_t *p)
{
	uint32_t byte_count=0;
	if (p[byte_count++]==AckChl)
	{
		takemeal_req.Ack =AckChl;
		takemeal_req.Ack_Len = (p[byte_count++]<<4);
		takemeal_req.Ack_Len += (p[byte_count++]); 
		for(uint8_t i=0;i<takemeal_req.Ack_Len;i++)
		{
			takemeal_req.Ack_Chl[i] = p[byte_count++];
		}
	}
	if (p[byte_count++]==MacChl)
	{
		takemeal_req.Mac =MacChl;
		takemeal_req.Mac_Len = (p[byte_count++]<<4);
		takemeal_req.Mac_Len += (p[byte_count++]); 
		for(uint8_t i=0;i<takemeal_req.Mac_Len;i++)
		{
			takemeal_req.Mac_Chl[i] = p[byte_count++];
		}
	}	
	return 0;
}

