CaishunChen/STM32F4x7_ETH_LwIP_V1.1.0/Project/FreeRTOS/httpserver_netconn/src/tcp_server.c
ECHO_REQ_STRUCT echo_req;
static uint8_t decode_echo_data(uint8_t *p)
{
	uint32_t byte_count=0;
	if (p[byte_count++]==DealDataChl)
	{
		echo_req.DealData =DealDataChl;
		echo_req.DealData_Len = (p[byte_count++]<<4);
		echo_req.DealData_Len += (p[byte_count++]); 
		for(uint8_t i=0;i<echo_req.DealData_Len;i++)
		{
			echo_req.DealData_Chl[i] = p[byte_count++];
		}
	}
	if (p[byte_count++]==DealTimeChl)
	{
		echo_req.DealTime =DealTimeChl;
		echo_req.DealTime_Len = (p[byte_count++]<<4);
		echo_req.DealTime_Len += (p[byte_count++]); 
		for(uint8_t i=0;i<echo_req.DealTime_Len;i++)
		{   
			echo_req.DealTime_Chl[i] = p[byte_count++];
		}
	}
	if (p[byte_count++]==AckChl)
	{
		echo_req.Ack =AckChl;
		echo_req.Ack_Len = (p[byte_count++]<<4);
		echo_req.Ack_Len += (p[byte_count++]); 
		for(uint8_t i=0;i<echo_req.Ack_Len;i++)
		{
			echo_req.Ack_Chl[i] = p[byte_count++];
		}
	}
	return 0;
}
/**
  * @brief  向服务器发送签到数据
  * @param  NewState: new state of the Prefetch Buffer.
  *          This parameter  can be: ENABLE or DISABLE.
  * @retval None
  */
xQueueHandle xQueue;
long lReceivedValue;
/*-----------------------------------------------------------------------------------*/
static void tcpclient_thread(void *arg)
{
	struct netconn *tcp_clientconn;
	struct ip_addr ServerIPaddr;

	struct   netbuf *inbuf;
	uint8_t* buf;
	uint16_t buflen;	
	
	portBASE_TYPE xStatus;
	const portTickType xTicksToWait =  10 / portTICK_RATE_MS;
	static err_t err,recv_err;
	static uint8_t  send_success_flag = 0x00;
	LWIP_UNUSED_ARG(arg);
	
	/* add SERVER_IP to ServerIPaddr*/
	IP4_ADDR( &ServerIPaddr, SERVER_IP_ADDR0, SERVER_IP_ADDR1, SERVER_IP_ADDR2, SERVER_IP_ADDR3 );

	xQueue = xQueueCreate( 10, sizeof( long ) );

  #if 1
	while(1)
	{
	  /* Create a new connection identifier. */
		tcp_clientconn = netconn_new(NETCONN_TCP);
		if (tcp_clientconn!=NULL)
		{  
			/*built a connect to server*/
			err = netconn_connect(tcp_clientconn,&ServerIPaddr,SERVER_PORT);
			if (err != ERR_OK)  netconn_delete(tcp_clientconn); 
			else if (err == ERR_OK)
			{
				/*timeout to wait for new data to be received <Avoid death etc.> */
				netconn_set_sendtimeout(tcp_clientconn,10);
				netconn_set_recvtimeout(tcp_clientconn,800);

				while(1)
				{
					//if((tcp_client_flag & SignInFlag) == SignInFlag)  
					xStatus = xQueueReceive( xQueue,
											 &lReceivedValue,
											 xTicksToWait );
					if(xStatus == pdPASS)
					//if(lReceivedValue>0)                        
					{
						//netconn_set_sendtimeout(tcp_clientconn,10);
						//printf("xStatus = pdPASS.\r\n");
						switch(lReceivedValue)
						{
							case SignInReq:{
								auto uint8_t sign_in_buf[Totoal_SignIn_Lenth+ 8]={0};  //使用auto，该类具有自动存储期
								package_buff(SignInReq,sign_in_buf);   //将要发送的数据填入sendbuf        
								err=netconn_write(tcp_clientconn,\
								sign_in_buf,sizeof(sign_in_buf),\
								NETCONN_COPY); 
								if(err != ERR_OK)  
									printf(" SignInReq erro code is ERR_TIMEOUT \r\n");      
							};break;
							case MealComparReq:{
								auto uint8_t meal_compar_buf[Totoal_MealCompar_Lenth+ 8]={0};  //使用auto，该类具有自动存储期
								package_buff(MealComparReq,meal_compar_buf);   //将要发送的数据填入sendbuf        
								err=netconn_write(tcp_clientconn,\
							 	meal_compar_buf,sizeof(meal_compar_buf),\
								NETCONN_COPY); 
								if(err != ERR_OK)  
									printf("MealComparReq erro code is %d\r\n",err);                     
							};break;
							case StatuUploadReq:{
								auto uint8_t statu_upload_buf[Totoal_StatuUpload_Lenth+ 8]={0};  //使用auto，该类具有自动存储期
								package_buff(StatuUploadReq,statu_upload_buf);   //将要发送的数据填入sendbuf        
								err=netconn_write(tcp_clientconn,\
								statu_upload_buf,sizeof(statu_upload_buf),\
								NETCONN_COPY); 
								if(err != ERR_OK)  
									printf("StatuUploadReq erro code is %d\r\n",err);                               
							};break;
							case TkMealReq:{
								auto uint8_t tk_meal_buf[Tk_Meal_Lenth+ 8]={0};  //使用auto，该类具有自动存储期
								package_buff(TkMealReq,tk_meal_buf);   //将要发送的数据填入sendbuf    
								err=netconn_write(tcp_clientconn,\
								tk_meal_buf,sizeof(tk_meal_buf),\
								NETCONN_COPY); 
								if(err != ERR_OK)  
									printf("StatuUploadReq erro code is %d\r\n",err);      				
							};break;
							case EchoReq:{
								auto uint8_t echo_buf[Totoal_Echo_Lenth+ 8]={0};  //使用auto，该类具有自动存储期
								package_buff(EchoReq,echo_buf);   //将要发送的数据填入sendbuf    
								err=netconn_write(tcp_clientconn,\
								echo_buf,sizeof(echo_buf),\
								NETCONN_COPY); 
								if(err != ERR_OK)  
									printf("StatuUploadReq erro code is %d\r\n",err);      	
							};break;
							default:break;
						}
						send_success_flag = 0x01; 
						//接受一个Queue后，进行计时，2S后无数据判断失败
					}
					recv_err = netconn_recv(tcp_clientconn, &inbuf);
					if (recv_err == ERR_OK)
					{
						if (netconn_err(tcp_clientconn ) == ERR_OK)
						{ 
							netbuf_data(inbuf, (void**)&buf, &buflen);
							decode_host_data(buf);
							netbuf_delete(inbuf);
							send_success_flag = 0x00; 
							lReceivedValue = 0 ; 
						}
						else
						{
							printf("recv_err != ERR_OK \r\n");
						}
					}
					else if((recv_err == ERR_TIMEOUT)&&(send_success_flag == 0x01)) 
					{
						send_success_flag = 0x00;
						printf("recv_err == %d\r\n",recv_err);
						netconn_close(tcp_clientconn);
						netbuf_delete(inbuf);
						netconn_delete(tcp_clientconn);
						break;
					}
				}
			}
		}     
	}
#endif
}

/*-----------------------------------------------------------------------------------*/

void Tcpclient_Init(void)
{
  sys_thread_new("tcpserv", tcpclient_thread, NULL, DEFAULT_THREAD_STACKSIZE * 2, TCPCLIENT_THREAD_PRIO);
}
/*-----------------------------------------------------------------------------------*/

#endif /* LWIP_NETCONN */


